Autodesk.Navisworks.Api.FolderItem
A simple folder of saved items.

Autodesk.Navisworks.Api.FolderItem.#ctor
Create an empty folder

Autodesk.Navisworks.Api.FolderItem.IsReadOnly
Gets a value indicating whether the object is read-only.